Repository: GE-Developer/VOID
Catalog: VOID/Resources/Localizable.xcstrings
Source language: en
Languages: ar, az, be, bn, ca, cs, da, de, el, es, fi, fr, he, hi, hr, hu, hy, id, is, it, ja, ka, kk, ko, ky, ms, nb, nl, pl, pt, ro, ru, sk, sv, th, tr, uk, vi, zh_hans, zh_hant

# Cryptography.encryption
source: Encryption
ar: التشفير
az: Şifrələmə
be: Шыфраванне
bn: এনক্রিপশন
ca: Xifratge
cs: Šifrování
da: Kryptering
de: Verschlüsselung
el: Κρυπτογράφηση
es: Cifrar
fi: Salaus
fr: Chiffrement
he: הצפנה
hi: एन्क्रिप्शन
hr: Šifriranje
hu: Titkosítás
hy: Կոդավորում
id: Enkripsi
is: Dulkóðun
it: Cifratura
ja: 暗号化
ka: შიფრაცია
kk: Шифрлау
ko: 암호화
ky: Шифрлөө
ms: Penyulitan
nb: Kryptering
nl: Versleuteling
pl: Szyfrowanie
pt: Criptografia
ro: Criptare
ru: Шифрование
sk: Šifrovanie
sv: Kryptering
th: การเข้ารหัส
tr: Şifreleme
uk: Шифрування
vi: Mã hóa
zh_hans: 加密
zh_hant: 加密

# Cryptography.Placeholder.decrypt
source: Ready to decrypt...
ar: جاهز لفك التشفير...
az: Deşifrəyə hazır...
be: Гатова да дэшыфравання...
bn: ডিক্রিপ্ট করার জন্য প্রস্তুত...
ca: A punt per desxifrar...
cs: Připraveno k dešifrování...
da: Klar til dekryptering...
de: Bereit zum Entschlüsseln…
el: Έτοιμο για αποκρυπτογράφηση...
es: Listo para descifrar…
fi: Valmis salauksen purkuun...
fr: Prêt à déchiffrer…
he: מוכן לפענוח...
hi: डिक्रिप्ट करने के लिए तैयार...
hr: Spremno za dešifriranje...
hu: Készen áll a visszafejtésre...
hy: Պատրաստ է ապակոդավորման…
id: Siap mendekripsi...
is: Tilbúið til að afkóða...
it: Pronto per decifrare…
ja: 復号の準備ができました…
ka: მომზადებულია დეშიფრაციისთვის…
kk: Шифрды шешуге дайын...
ko: 복호화 준비 중…
ky: Шифрди чечүүгө даяр...
ms: Sedia untuk nyahsulit...
nb: Klar til å dekryptere...
nl: Klaar om te ontsleutelen…
pl: Gotowe do odszyfrowania...
pt: Pronto para descriptografar…
ro: Gata pentru decriptare...
ru: Готово к дешифрованию…
sk: Pripravené na dešifrovanie...
sv: Redo att dekryptera…
th: พร้อมถอดรหัส...
tr: Çözmeye hazır…
uk: Готово до розшифрування…
vi: Sẵn sàng giải mã…
zh_hans: 准备解密…
zh_hant: 準備解密…

# Cryptography.Placeholder.default
source: Set the password!
ar: أدخل كلمة المرور!
az: Şifrə təyin et!
be: Увядзіце пароль!
bn: পাসওয়ার্ড দিন!
ca: Configura la contrasenya!
cs: Nastavte heslo!
da: Angiv adgangskoden!
de: Passwort festlegen!
el: Ρυθμίστε τον κωδικό πρόσβασης!
es: ¡Establece la contraseña!
fi: Aseta salasana!
fr: Définir le mot de passe !
he: הגדר סיסמה!
hi: पासवर्ड सेट करें!
hr: Postavi lozinku!
hu: Állíts be jelszót!
hy: Սահմանեք գաղտնաբառ!
id: Atur kata sandi!
is: Stilltu lykilorðið!
it: Imposta la password!
ja: パスワードを設定してください！
ka: დააყენეთ პაროლი!
kk: Құпия сөзді орнатыңыз!
ko: 비밀번호를 설정하세요!
ky: Сырсөздү орнотуңуз!
ms: Tetapkan kata laluan!
nb: Sett passord!
nl: Stel het wachtwoord in!
pl: Ustaw hasło!
pt: Defina a senha!
ro: Setează parola!
ru: Установите пароль!
sk: Nastav heslo!
sv: Ställ in lösenord!
th: ตั้งค่ารหัสผ่าน!
tr: Parolayı ayarlayın!
uk: Встановити пароль!
vi: Hãy đặt mật khẩu!
zh_hans: 请设置密码！
zh_hant: 請設定密碼！

# Cryptography.Placeholder.encrypt
source: Ready to encrypt...
ar: جاهز للتشفير...
az: Şifrələməyə hazır...
be: Гатова да шыфравання...
bn: এনক্রিপ্ট করার জন্য প্রস্তুত...
ca: A punt per xifrar...
cs: Připraveno k šifrování...
da: Klar til kryptering...
de: Bereit zum Verschlüsseln…
el: Έτοιμο για κρυπτογράφηση...
es: Listo para cifrar…
fi: Valmis salaukseen...
fr: Prêt à chiffrer…
he: מוכן להצפנה...
hi: एन्क्रिप्ट करने के लिए तैयार...
hr: Spremno za šifriranje...
hu: Készen áll a titkosításra...
hy: Պատրաստ է կոդավորման…
id: Siap mengenkripsi...
is: Tilbúið til að dulrita...
it: Pronto per cifrare…
ja: 暗号化の準備ができました…
ka: მომზადებულია გასაშიფრად...
kk: Шифрлауға дайын...
ko: 암호화 준비 중…
ky: Шифрлөөгө даяр...
ms: Sedia untuk sulitkan...
nb: Klar til å kryptere...
nl: Klaar om te versleutelen…
pl: Gotowe do szyfrowania...
pt: Pronto para criptografar…
ro: Gata pentru criptare...
ru: Готово к шифрованию…
sk: Pripravené na šifrovanie...
sv: Redo att kryptera…
th: พร้อมเข้ารหัส...
tr: Şifrelemeye hazır…
uk: Готово до шифрування…
vi: Sẵn sàng mã hóa…
zh_hans: 准备加密…
zh_hant: 準備加密…

# Cryptography.title
source: Cryptography
ar: التشفير
az: Kriptoqrafiya
be: Крыптаграфія
bn: ক্রিপ্টোগ্রাফি
ca: Criptografia
cs: Kryptografie
da: Kryptografi
de: Kryptografie
el: Κρυπτογραφία
es: Criptografía
fi: Kryptografia
fr: Cryptographie
he: הצפנה
hi: क्रिप्टोग्राफी
hr: Kriptografija
hu: Kriptográfia
hy: Կրիպտոգրաֆիա
id: Kriptografi
is: Dulkóðun
it: Crittografia
ja: 暗号学
ka: კრიპტოგრაფია
kk: Криптография
ko: 암호학
ky: Криптография
ms: Kriptografi
nb: Kryptografi
nl: Cryptografie
pl: Kryptografia
pt: Criptografia
ro: Criptografie
ru: Криптография
sk: Kryptografia
sv: Kryptografi
th: คริปโตกราฟี
tr: Kriptografi
uk: Криптографія
vi: Mật mã
zh_hans: 密码学
zh_hant: 密碼學

# CryptoSettings.dividerMessage
source: ↓ For encryption only ↓
ar: ↓ للتشفير فقط ↓
az: ↓ Yalnız şifrələmə üçün ↓
be: ↓ Толькі для шыфравання ↓
bn: ↓ শুধুমাত্র এনক্রিপশনের জন্য ↓
ca: ↓ Només per al xifrat ↓
cs: ↓ Pouze pro šifrování ↓
da: ↓ Kun til kryptering ↓
de: ↓ Nur für die Verschlüsselung ↓
el: ↓ Μόνο για κρυπτογράφηση ↓
es: ↓ Solo para cifrado ↓
fi: ↓ Vain salausta varten ↓
fr: ↓ Seulement pour le chiffrement ↓
he: ↓ להצפנה בלבד ↓
hi: ↓ केवल एन्क्रिप्शन के लिए ↓
hr: ↓ Samo za šifriranje ↓
hu: ↓ Csak titkosításhoz ↓
hy: ↓ Միայն կոդավորման համար ↓
id: ↓ Hanya untuk enkripsi ↓
is: ↓ Aðeins fyrir dulkóðun ↓
it: ↓ Solo per la cifratura ↓
ja: ↓ 暗号化のみ ↓
ka: ↓ მხოლოდ შიფრაციისთვის ↓
kk: ↓ Тек шифрлау үшін ↓
ko: ↓ 암호화 전용 ↓
ky: ↓ Шифрлөө үчүн гана ↓
ms: ↓ Untuk penyulitan sahaja ↓
nb: ↓ Kun for kryptering ↓
nl: ↓ Alleen voor versleuteling ↓
pl: ↓ Tylko do szyfrowania ↓
pt: ↓ Apenas para criptografia ↓
ro: ↓ Doar pentru criptare ↓
ru: ↓ Только для шифрования ↓
sk: ↓ Len na šifrovanie ↓
sv: ↓ Endast för kryptering ↓
th: ↓ สำหรับการเข้ารหัสเท่านั้น ↓
tr: ↓ Yalnızca şifreleme için ↓
uk: ↓ Лише для шифрування ↓
vi: ↓ Chỉ dành cho mã hóa ↓
zh_hans: ↓ 仅用于加密 ↓
zh_hant: ↓ 僅用於加密 ↓

# CryptoSettings.extreme
source: Extreme
ar: أقصى
az: Ekstremal
be: Экстрэмальны
bn: চরম
ca: Extrem
cs: Extrémní
da: Ekstrem
de: Extrem
el: Ακραίο
es: Extremo
fi: Äärimmäinen
fr: Extrême
he: קיצוני
hi: अत्यधिक
hr: Ekstremno
hu: Extrém
hy: Ծայրահեղ
id: Ekstrem
is: Öfgakennt
it: Estremo
ja: 極限
ka: ექსტრემალური
kk: Экстремалды
ko: 극도로 강함
ky: Экстремалдуу
ms: Melampau
nb: Ekstrem
nl: Extreem
pl: Ekstremalne
pt: Extremo
ro: Extrem
ru: Экстремально
sk: Extrém
sv: Extrem
th: ขั้นสุด
tr: Aşırı
uk: Екстремально
vi: Cực mạnh
zh_hans: 极高
zh_hant: 極高

# CryptoSettings.highCPU
source: High CPU
ar: معالج عالٍ
az: Yüksək CPU
be: Высокі CPU
bn: উচ্চ CPU
ca: CPU alta
cs: Vysoké CPU
da: Høj CPU
de: Hohe Auslastung
el: Υψηλό CPU
es: Alto uso de CPU
fi: Korkea CPU
fr: CPU élevé
he: מעבד גבוה
hi: उच्च CPU
hr: Visok CPU
hu: Magas CPU
hy: Բարձր CPU
id: CPU Tinggi
is: Hátt CPU
it: Alta CPU
ja: 高負荷
ka: მაღალი CPU
kk: Жоғары CPU
ko: 높은 부하
ky: Жогорку CPU
ms: CPU Tinggi
nb: Høy CPU
nl: Hoge belasting
pl: Wysokie CPU
pt: Alta carga
ro: CPU ridicat
ru: Высокая нагрузка
sk: Vysoké CPU
sv: Hög belastning
th: CPU สูง
tr: Yüksek yük
uk: Високе навантаження
vi: Tải cao
zh_hans: 高负载
zh_hant: 高負載

# CryptoSettings.Iterations.instructions
source: The number of **iterations** affects encryption **strength**. More = harder to crack, but **slower**.
ar: عدد **التكرارات** يؤثر على **قوة** التشفير. أكثر = أصعب كسراً، لكن **أبطأ**.
az: **İterasiya sayı** şifrələmənin **gücünə** təsir edir. Daha çox = sındırmaq çətindir, lakin **daha yavaşdır**.
be: Колькасць **ітэрацый** уплывае на **моц** шыфравання. Больш = цяжэй узламаць, але **павольней**.
bn: **পুনরাবৃত্তির** সংখ্যা এনক্রিপশনের **শক্তিকে** প্রভাবিত করে। বেশি = ক্র্যাক করা কঠিন, কিন্তু **ধীর**।
ca: El nombre d'**iteracions** afecta la **fortalesa** del xifrat. Més = més difícil de trencar, però **més lent**.
cs: Počet **iterací** ovlivňuje **sílu** šifrování. Více = obtížnější prolomení, ale **pomalejší**.
da: Antallet af **iterationer** påvirker **styrken** af krypteringen. Flere = sværere at knække, men **langsommere**.
de: Die Anzahl der **Iterationen** beeinflusst die **Stärke** der Verschlüsselung. Mehr Iterationen = schwerer zu knacken, aber **langsamer**.
el: Ο αριθμός των **επαναλήψεων** επηρεάζει τη **δύναμη** της κρυπτογράφησης. Περισσότερες = πιο δύσκολο να παραβιαστεί, αλλά **πιο αργό**.
es: El número de **iteraciones** afecta la **fuerza** del cifrado. Más iteraciones = más difícil de descifrar, pero **más lento**.
fi: **Iteraatioiden määrä** vaikuttaa salauksen **vahvuuteen**. Enemmän = vaikeampi murtaa, mutta **hitaampi**.
fr: Le nombre d'**itérations** influence la **force** du chiffrement. Plus d'itérations = plus difficile à craquer, mais **plus lent**.
he: מספר **האיטרציות** משפיע על **חוזק** ההצפנה. יותר = קשה יותר לפצח, אך **איטי יותר**.
hi: **पुनरावृत्तियों** की संख्या एन्क्रिप्शन की **मज़बूती** को प्रभावित करती है। जितनी अधिक होंगी = तोड़ना उतना कठिन, लेकिन **गति धीमी**।
hr: Broj **iteracija** utječe na **snagu** šifriranja. Više = teže probiti, ali **sporije**.
hu: Az **iterációk száma** befolyásolja a titkosítás **erősségét**. Több = nehezebb feltörni, de **lassabb**.
hy: **Իտերացիաների քանակը** ազդում է կոդավորման **ուժի** վրա. Ավելի շատ = կոտրելն ավելի դժվար է, բայց **ավելի դանդաղ**.
id: Jumlah **iterasi** memengaruhi **kekuatan** enkripsi. Lebih banyak = lebih sulit dibobol, tetapi **lebih lambat**.
is: Fjöldi **ítrana** hefur áhrif á **styrk** dulkóðunar. Meira = erfiðara að brjóta, en **hægara**.
it: Il numero di **iterazioni** influisce sulla **forza** della cifratura. Più iterazioni = più difficile da decifrare, ma **più lento**.
ja: **反復回数**は暗号化の**強度**に影響します。 回数が多いほど解読は難しくなりますが、**処理は遅く**なります。
ka: **იტერაციების რაოდენობა** გავლენას ახდენს **შიფრაციის სიმტკიცეზე**. რაოდენობის გაზრდა ართულებს დაშიფვრას, მაგრამ **ამცირებს სიჩქარეს**.
kk: **Итерация** саны шифрлаудың **күшіне** әсер етеді. Көбірек = бұзу қиынырақ, бірақ **баяуырақ**.
ko: **반복 횟수**는 암호화의 **강도**에 영향을 줍니다。 횟수가 많을수록 풀기 어렵지만 **속도는 느려집니다**。
ky: **Итерациялар** саны шифрлөөнүн **күчүнө** таасир этет. Көбүрөөк = бузуу кыйыныраак, бирок **жайыраак**.
ms: Bilangan **iterasi** mempengaruhi **kekuatan** penyulitan. Lebih banyak = lebih sukar dipecahkan, tetapi **lebih perlahan**.
nb: Antallet **iterasjoner** påvirker **styrken** på krypteringen. Flere = vanskeligere å knekke, men **langsommere**.
nl: Het aantal **iteraties** beïnvloedt de **sterkte** van de versleuteling. Meer = moeilijker te kraken, maar **langzamer**.
pl: Liczba **iteracji** wpływa na **siłę** szyfrowania. Więcej = trudniej złamać, ale **wolniej**.
pt: **O número de iterações** afeta a **força** da criptografia. Quanto maior, mais difícil de quebrar, porém **mais lento**.
ro: Numărul de **iterații** influențează **puterea** criptării. Mai multe = mai greu de spart, dar **mai lent**.
ru: **Количество итераций** влияет на **силу** шифрования: чем больше итераций, тем сложнее взломать, но тем **медленнее** процесс шифрования и расшифровки данных.
sk: Počet **iterácií** ovplyvňuje **silou** šifrovania. Viac = ťažšie prelomiť, ale **pomalšie**.
sv: Antalet **iterationer** påverkar krypteringens **styrka**. Fler = svårare att knäcka, men **långsammare**.
th: จำนวน **รอบ** มีผลต่อ **ความแข็งแกร่ง** ของการเข้ารหัส. ยิ่งมาก = ยากต่อการถอด แต่ **ช้าลง**.
tr: **İterasyon sayısı** şifrelemenin **gücünü** etkiler. Daha fazla = kırması zor, ancak **daha yavaş**.
uk: Кількість **ітерацій** впливає на **стійкість** шифрування. Більше = складніше зламати, але **повільніше**.
vi: **Số vòng lặp** ảnh hưởng đến **độ mạnh** của mã hóa. Vòng lặp càng nhiều thì càng khó bẻ khóa nhưng quá trình sẽ **chậm hơn**.
zh_hans: **迭代次数**会影响加密的**强度**。 迭代越多，越难破解，但速度会**变慢**。
zh_hant: **迭代次數**會影響加密的**強度**。 迭代越多，越難破解，但速度會**變慢**。

# CryptoSettings.Iterations.title
source: Iterations
ar: التكرارات
az: İterasiyalar
be: Ітэрацыі
bn: পুনরাবৃত্তি
ca: Iteracions
cs: Iterace
da: Iterationer
de: Iterationen
el: Επαναλήψεις
es: Iteraciones
fi: Iteraatiot
fr: Itérations
he: איטרציות
hi: पुनरावृत्तियाँ
hr: Iteracije
hu: Iterációk
hy: Իտերացիաներ
id: Iterasi
is: Ítranir
it: Iterazioni
ja: 反復回数
ka: იტერაციები
kk: Итерациялар
ko: 반복
ky: Итерациялар
ms: Iterasi
nb: Iterasjoner
nl: Iteraties
pl: Iteracje
pt: Iterações
ro: Iterații
ru: Итерации
sk: Iterácie
sv: Iterationer
th: จำนวนรอบ
tr: İterasyonlar
uk: Ітерації
vi: Vòng lặp
zh_hans: 迭代
zh_hant: 迭代

# CryptoSettings.KeyLength.instructions
source: **Key length** defines how hard it is to brute-force your data — the **longer** the key, the **stronger** the protection. Higher values increase security but may slightly slow down processing.
ar: **طول المفتاح** يحدد مدى صعوبة كسر بياناتك — **كلما طال** المفتاح، **كانت** الحماية **أقوى**. القيم الأعلى تزيد الأمان لكنها قد تُبطئ المعالجة قليلاً.
az: **Açarın uzunluğu** məlumatların güc tətbiqi ilə sındırılmasını nə qədər çətinləşdirəcəyini müəyyən edir — açar nə qədər **uzundursa**, mühafizə bir o qədər **güclüdür**. Yüksək dəyərlər təhlükəsizliyi artırır, amma işlənməni cüzi ləngidə bilər.
be: **Даўжыня ключа** вызначае, наколькі складана перабраць вашы даныя — чым **даўжэйшы** ключ, тым **мацнейшая** абарона. Большыя значэнні павышаюць бяспеку, але могуць злёгку запавольваць апрацоўку.
bn: **কী দৈর্ঘ্য** নির্ধারণ করে আপনার ডেটা ব্রুট-ফোর্স করা কতটা কঠিন — কী **যত দীর্ঘ**, সুরক্ষা **তত শক্তিশালী**। উচ্চতর মান নিরাপত্তা বাড়ায় কিন্তু প্রক্রিয়াকরণ সামান্য ধীর করতে পারে।
ca: La **longitud de la clau** determina com de difícil és forçar les teves dades — com **més llarga** sigui la clau, **més forta** és la protecció. Els valors més alts incrementen la seguretat però poden alentir una mica el processament.
cs: **Délka klíče** určuje, jak obtížné je vaše data prolomit hrubou silou — čím je klíč **delší**, tím je ochrana **silnější**. Vyšší hodnoty zvyšují bezpečnost, ale mohou mírně zpomalit zpracování.
da: **Nøglens længde** bestemmer, hvor svært det er at brute-force dine data — jo **længere** nøglen er, desto **stærkere** er beskyttelsen. Højere værdier øger sikkerheden, men kan gøre behandlingen en smule langsommere.
de: Die **Schlüssellänge** bestimmt, wie schwer es ist, deine Daten per Brute Force zu knacken — je **länger** der Schlüssel, desto **stärker** der Schutz. Höhere Werte erhöhen die Sicherheit, können die Verarbeitung jedoch leicht verlangsamen.
el: Το **μήκος του κλειδιού** καθορίζει πόσο δύσκολο είναι να γίνει brute force στα δεδομένα σας — όσο **μεγαλύτερο** το κλειδί, τόσο **ισχυρότερη** η προστασία. Μεγαλύτερες τιμές αυξάνουν την ασφάλεια αλλά μπορεί να επιβραδύνουν ελαφρώς την επεξεργασία.
es: La **longitud de la clave** define lo difícil que es forzar tus datos mediante fuerza bruta — cuanto **más larga** es la clave, **mayor** es la protección. Valores más altos aumentan la seguridad, pero pueden ralentizar ligeramente el procesamiento.
fi: **Avaimen pituus** määrittää, kuinka vaikeaa tietosi on murtaa brute forcella — mitä **pidempi** avain on, sitä **vahvempi** suoja. Suuremmat arvot lisäävät turvallisuutta, mutta voivat hieman hidastaa käsittelyä.
fr: La **longueur de la clé** détermine la difficulté de forcer les données. Plus la clé est **longue**, plus la protection est **forte**. Des valeurs plus élevées augmentent la sécurité mais peuvent légèrement ralentir le traitement.
he: **אורך המפתח** קובע כמה קשה לפרוץ את הנתונים שלך — **ככל שהמפתח ארוך** יותר, **כך ההגנה חזקה** יותר. ערכים גבוהים יותר מגבירים אבטחה אך עלולים להאט מעט את העיבוד.
hi: **कुंजी की लंबाई** तय करती है कि आपके डेटा पर बलपूर्वक हमला करना कितना कठिन होगा — कुंजी जितनी **लंबी**, सुरक्षा उतनी **मजबूत**। उच्च मान सुरक्षा बढ़ाते हैं लेकिन प्रोसेसिंग को थोड़ा धीमा कर सकते हैं।
hr: **Duljina ključa** određuje koliko je teško na silu doći do vaših podataka — što je ključ **dulji**, to je zaštita **jača**. Više vrijednosti povećavaju sigurnost, ali mogu malo usporiti obradu.
hu: A **kulcshossz** határozza meg, mennyire nehéz brute force-szal feltörni az adataidat — minél **hosszabb** a kulcs, annál **erősebb** a védelem. A magasabb értékek növelik a biztonságot, de kissé lassíthatják a feldolgozást.
hy: **Բանալու երկարությունը** որոշում է, թե որքան բարդ կլինի տվյալները կոտրել ուժի կիրառմամբ — որքան **երկար է բանալին**, այնքան **ուժեղ է պաշտպանությունը**. Բարձր արժեքները բարձրացնում են անվտանգությունը, սակայն կարող են մի փոքր դանդաղեցնել մշակումը.
id: **Panjang kunci** menentukan seberapa sulit data Anda dibobol dengan brute force — semakin **panjang** kuncinya, semakin **kuat** perlindungannya. Nilai yang lebih tinggi meningkatkan keamanan namun dapat sedikit memperlambat pemrosesan.
is: **Lengd lykils** ákvarðar hversu erfitt er að brjóta gögnin þín með brute force — því **lengri** sem lykillinn er, því **sterkari** er verndin. Hærri gildi auka öryggi en geta aðeins hægt á vinnslu.
it: La **lunghezza della chiave** determina quanto è difficile forzare i dati. Più la chiave è **lunga**, più la protezione è **forte**. Valori più alti aumentano la sicurezza ma possono rallentare leggermente l'elaborazione.
ja: **鍵の長さ**はデータを総当たり攻撃で解読する難しさを決定します — 鍵が**長い**ほど保護は**強く**なります。 値が大きいほどセキュリティは向上しますが、処理がわずかに遅くなる場合があります。
ka: **გასაღები კოდის სიგრძე** განსაზღვრავს რამდენად რთულია თქვენი მონაცემების ბრუტფორსი — რაც **მეტია სიგრძე**, მით **მტკიცეა დაცვა**. მაღალი მნიშვნელობები ზრდის უსაფრთხოებას, თუმცა შესაძლოა ცოტა შეანელოს პროცესირება.
kk: **Кілт ұзындығы** деректеріңізді қатал іздеудің қаншалықты қиын екенін анықтайды — кілт **неғұрлым ұзын** болса, қорғаныс **соғұрлым күшті**. Жоғары мәндер қауіпсіздікті арттырады, бірақ өңдеуді сәл баяулатуы мүмкін.
ko: **키 길이**는 데이터를 무차별 대입으로 뚫기 어려운 정도를 결정합니다 — 키가 **길수록** 보호가 **강해집니다**。 값이 높을수록 보안은 증가하지만 처리 속도가 약간 느려질 수 있습니다。
ky: **Ачкыч узундугу** маалыматтарыңызды катаал издөөнүн канчалык кыйын экенин аныктайт — ачкыч **канчалык узун** болсо, коргоо **ошончолук күчтүү**. Жогорку маандер коопсуздукту жогорулатат, бирок иштетүүнү бир аз жайлатышы мүмкүн.
ms: **Panjang kunci** menentukan betapa sukarnya data anda dipecahkan secara brute force — semakin **panjang** kunci, semakin **kukuh** perlindungan. Nilai yang lebih tinggi meningkatkan keselamatan tetapi boleh sedikit memperlahankan pemprosesan.
nb: **Nøkkellengden** bestemmer hvor vanskelig det er å brute-force dataene dine — jo **lengre** nøkkelen er, desto **sterkere** er beskyttelsen. Høyere verdier øker sikkerheten, men kan gjøre behandlingen litt tregere.
nl: De **sleutellengte** bepaalt hoe moeilijk het is om je gegevens met brute force te kraken — hoe **langer** de sleutel, hoe **sterker** de bescherming. Hogere waarden vergroten de veiligheid maar kunnen de verwerking iets vertragen.
pl: **Długość klucza** określa, jak trudno jest złamać dane metodą brute force — im **dłuższy** klucz, tym **silniejsza** ochrona. Wyższe wartości zwiększają bezpieczeństwo, lecz mogą nieznacznie spowolnić przetwarzanie.
pt: **O comprimento da chave** define o quão difícil é quebrar seus dados por força bruta — quanto mais **longa** a chave, mais **forte** a proteção. Valores maiores aumentam a segurança, mas podem deixar o processamento um pouco mais lento.
ro: **Lungimea cheii** determină cât de greu este să-ți fie sparte datele prin forță brută — cu cât cheia este **mai lungă**, cu atât protecția este **mai puternică**. Valorile mai mari cresc securitatea, dar pot încetini ușor procesarea.
ru: **Длина ключа** определяет, насколько сложно взломать ваши данные перебором — чем **длиннее** ключ, тем **выше защита**. Большие значения повышают безопасность, но могут немного замедлить обработку.
sk: **Dĺžka kľúča** určuje, ako ťažké je prelomiť tvoje dáta hrubou silou — čím je kľúč **dlhší**, tým je ochrana **silnejšia**. Vyššie hodnoty zvyšujú bezpečnosť, ale môžu mierne spomaliť spracovanie.
sv: **Nyckellängden** avgör hur svårt det är att knäcka dina data genom brute force — ju **längre** nyckeln är, desto **starkare** skydd. Högre värden ökar säkerheten men kan göra bearbetningen något långsammare.
th: **ความยาวของคีย์** กำหนดว่าการบังคับถอดข้อมูลของคุณยากเพียงใด — ยิ่งคีย์ **ยาว** การป้องกันก็ยิ่ง **แข็งแรง**. ค่าที่สูงขึ้นเพิ่มความปลอดภัย แต่สามารถทำให้การประมวลผลช้าลงเล็กน้อย.
tr: **Anahtar uzunluğu**, verilerinizin brute force ile kırılmasının zorluğunu belirler — anahtar ne kadar **uzunsa**, koruma o kadar **güçlüdür**. Daha yüksek değerler güvenliği artırır ancak işlemi biraz yavaşlatabilir.
uk: **Довжина ключа** означає, наскільки складно підібрати ваші дані методом brute-force — чим **довший** ключ, тим **сильніший** захист. Вищі значення підвищують безпеку, але можуть трохи сповільнити обробку.
vi: **Độ dài khóa** quyết định mức độ khó khi bị brute-force — khóa càng **dài**, bảo vệ càng **mạnh**. Giá trị cao hơn giúp tăng bảo mật nhưng có thể làm chậm xử lý đôi chút.
zh_hans: **密钥长度**决定了数据被暴力破解的难度 — 密钥越**长**，防护越**强**。 更高的数值可提升安全性，但可能会略微降低处理速度。
zh_hant: **金鑰長度**決定了資料被暴力破解的難度——金鑰越**長**，防護越**強**。 更高的數值可提升安全性，但可能會略微降低處理速度。

# CryptoSettings.KeyLength.title
source: Key Length
ar: طول المفتاح
az: Açar uzunluğu
be: Даўжыня ключа
bn: কী দৈর্ঘ্য
ca: Longitud de la clau
cs: Délka klíče
da: Nøglelængde
de: Schlüssellänge
el: Μήκος κλειδιού
es: Longitud de la clave
fi: Avaimen pituus
fr: Longueur de la clé
he: אורך מפתח
hi: कुंजी की लंबाई
hr: Duljina ključa
hu: Kulcshossz
hy: Բանալու երկարություն
id: Panjang Kunci
is: Lykillengd
it: Lunghezza chiave
ja: 鍵の長さ
ka: გასაღები კოდის სიგრძე
kk: Кілт ұзындығы
ko: 키 길이
ky: Ачкыч узундугу
ms: Panjang Kunci
nb: Nøkkellengde
nl: Sleutellengte
pl: Długość klucza
pt: Comprimento da chave
ro: Lungimea cheii
ru: Длина ключа
sk: Dĺžka kľúča
sv: Nyckellängd
th: ความยาวคีย์
tr: Anahtar uzunluğu
uk: Довжина ключа
vi: Độ dài khóa
zh_hans: 密钥长度
zh_hant: 金鑰長度
